#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

random_id.bucket_prefix: Refreshing state... [id=8SRJtigRZlE]
data.google_iam_policy.noauth: Reading...
google_artifact_registry_repository.broscience_registry: Refreshing state... [id=projects/peaceful-ares/locations/europe-west4/repositories/peaceful-ares-registry]
data.google_iam_policy.noauth: Read complete after 0s [id=3450855414]
google_storage_bucket.default: Refreshing state... [id=f12449b628116651-bucket-tfstate]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_cloud_run_domain_mapping.broscience_xyz_domain will be created
  + resource "google_cloud_run_domain_mapping" "broscience_xyz_domain" {
      + id       = (known after apply)
      + location = "europe-west4"
      + name     = "broscience.xyz"
      + project  = (known after apply)
      + status   = (known after apply)

      + metadata {
          + annotations      = (known after apply)
          + generation       = (known after apply)
          + labels           = (known after apply)
          + namespace        = "peaceful-ares"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + certificate_mode = "AUTOMATIC"
          + route_name       = "webapp-cloudrun-service"
        }
    }

  # google_cloud_run_domain_mapping.www_broscience_xyz_domain will be created
  + resource "google_cloud_run_domain_mapping" "www_broscience_xyz_domain" {
      + id       = (known after apply)
      + location = "europe-west4"
      + name     = "www.broscience.xyz"
      + project  = (known after apply)
      + status   = (known after apply)

      + metadata {
          + annotations      = (known after apply)
          + generation       = (known after apply)
          + labels           = (known after apply)
          + namespace        = "peaceful-ares"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + certificate_mode = "AUTOMATIC"
          + route_name       = "webapp-cloudrun-service"
        }
    }

  # google_cloud_run_service_iam_policy.noauth will be created
  + resource "google_cloud_run_service_iam_policy" "noauth" {
      + etag        = (known after apply)
      + id          = (known after apply)
      + location    = "europe-west4"
      + policy_data = jsonencode(
            {
              + bindings = [
                  + {
                      + members = [
                          + "allUsers",
                        ]
                      + role    = "roles/run.invoker"
                    },
                ]
            }
        )
      + project     = (known after apply)
      + service     = "webapp-cloudrun-service"
    }

  # google_cloud_run_v2_service.webapp_cloudrun_service will be created
  + resource "google_cloud_run_v2_service" "webapp_cloudrun_service" {
      + conditions              = (known after apply)
      + etag                    = (known after apply)
      + generation              = (known after apply)
      + id                      = (known after apply)
      + ingress                 = "INGRESS_TRAFFIC_ALL"
      + latest_created_revision = (known after apply)
      + latest_ready_revision   = (known after apply)
      + launch_stage            = (known after apply)
      + location                = "europe-west4"
      + name                    = "webapp-cloudrun-service"
      + observed_generation     = (known after apply)
      + project                 = (known after apply)
      + reconciling             = (known after apply)
      + terminal_condition      = (known after apply)
      + traffic_statuses        = (known after apply)
      + uid                     = (known after apply)
      + uri                     = (known after apply)

      + template {
          + max_instance_request_concurrency = (known after apply)
          + service_account                  = (known after apply)
          + timeout                          = (known after apply)

          + containers {
              + image = "europe-west4-docker.pkg.dev/peaceful-ares/broscience-registry/webapp:6af6252"

              + ports {
                  + container_port = 3000
                  + name           = (known after apply)
                }

              + resources {
                  + cpu_idle = true
                  + limits   = {
                      + "cpu"    = "1"
                      + "memory" = "128Mi"
                    }
                }
            }

          + scaling {
              + max_instance_count = 2
              + min_instance_count = 0
            }
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @lo-b, Action: `pull_request`*